# Файлы куки

Файлы куки содержат данные авторизованного пользователя, которые могут быть использованы сторонними программами. В боте куки применяются для выполнения следующих операций:

### Buff Cookies
- **Необходимы**: Pro парсеру для парсинга цен на флотовые предметы или автоматического принятия трейдов [(платная дополнительная опция)](https://t.me/floatfinder).
- **Активность**: Куки остаются активными недолго и нуждаются в обновлении по мере добавления новых конфигов.

### Steam Cookies
- **Необходимы**: Для покупки предметов или автоматического принятия трейдов [(платная дополнительная опция)](https://t.me/floatfinder).
- **Активность**: Куки остаются активными 24 часа и требуют регулярного обновления.

## Для обновления куки используйте несколько программ, размещённых в папке **Cookie Refresher**:

### 1. Manual Steam Cookies
- **Инструкция**: Необходимо авторизоваться вручную в Steam. Удобнее всего через QR код.

### 2. Manual Buff Cookies
- **Инструкция**: Необходимо авторизоваться вручную в Steam. Удобнее всего через QR код (не подходит для аккаунтов, где авторизация осуществляется по номеру телефона).

### 3. Steam Cookies
- **Инструкция**: Автоматическая авторизация для аккаунтов, подключенных к SDA (см. в отдельном туториале).

### 4. Open Id Cookies
- **Инструкция**: Автоматическая авторизация на Buff для аккаунтов, подключенных к SDA (см. в отдельном туториале).
